Котельников_АБ_70153995/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСвоеПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПриложенияХХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаРазработчикаХХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПриложенияХХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекретПриложенияХХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПользователяЭмаил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПриложенияЭмаил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиУведомлений</name>
    <attributes>
      <name>ЭтапУведомления</name>
      <type>
        <types>EnumRef.ЭтапыУведомлений</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонПисьма</name>
      <type>
        <types>CatalogRef.ШаблоныПисем</types>
      </type>
    </attributes>
    <attributes>
      <name>ОткликОтКандидата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Котельников_АБ_70153995/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ИспользоватьСвоеПриложение Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НазваниеПриложенияХХ"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПочтаРазработчикаХХ"));	
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИдентификаторПриложенияХХ"));	
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СекретПриложенияХХ"));	
	КонецЕсли;
	
КонецПроцедуры
